zeroxy21/2026_FRENCH_ROBOTICS_CUP_NINJABOT/Robot_Stm32_CubeIDE_ws/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUTTON_Pin GPIO_PIN_0
#define USER_BUTTON_GPIO_Port GPIOF
#define USER_BUTTON_EXTI_IRQn EXTI0_IRQn
#define LED_1_Pin GPIO_PIN_0
#define LED_1_GPIO_Port GPIOA
#define LED_2_Pin GPIO_PIN_4
#define LED_2_GPIO_Port GPIOA
#define Tirette_Pin GPIO_PIN_6
#define Tirette_GPIO_Port GPIOA
#define Tirette_EXTI_IRQn EXTI9_5_IRQn
#define SERVO2_Pin GPIO_PIN_7
#define SERVO2_GPIO_Port GPIOA
#define MOTOR2_Pin GPIO_PIN_10
#define MOTOR2_GPIO_Port GPIOB
#define TOF2_XSHUT_Pin GPIO_PIN_3
#define TOF2_XSHUT_GPIO_Port GPIOB
#define TOF2_INTERRUPT_Pin GPIO_PIN_4
#define TOF2_INTERRUPT_GPIO_Port GPIOB
#define TOF1_INTERRUPT_Pin GPIO_PIN_5
#define TOF1_INTERRUPT_GPIO_Port GPIOB
#define TOF1_XSHUT_Pin GPIO_PIN_6
#define TOF1_XSHUT_GPIO_Port GPIOB
#define TOF_SDA_Pin GPIO_PIN_7
#define TOF_SDA_GPIO_Port GPIOB
#define TOF_SCL_Pin GPIO_PIN_8
#define TOF_SCL_GPIO_Port GPIOB
#define LED_BAT_Pin GPIO_PIN_9
#define LED_BAT_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
